{
  "UniqueName": "sftp",
  "DocumentationUrl": "https://docs.microsoft.com/en-us/connectors/connector-reference/../sftp/",
  "Actions": [
    {
      "OperationId": "CopyFile",
      "Name": "Copy file [DEPRECATED]",
      "Description": "This action has been deprecated. Please use Copy file instead.\nThis operation copies a file to an SFTP server. If a file is being deleted/renamed on server right after it was copied, connector may return HTTP 404 error by it's design. Please use a delay for 1 minute before deleting or renaming newly created file.",
      "Anchor": "#copy-file-[deprecated]",
      "IsDeprecated": true
    },
    {
      "OperationId": "CreateFile",
      "Name": "Create file [DEPRECATED]",
      "Description": "This action has been deprecated. Please use Create file instead.\nThis operation uploads a file to an SFTP server. If a file is being deleted/renamed on server right after it was created, connector may return HTTP 404 error by it's design. Please use a delay for 1 minute before deleting or renaming newly created file.",
      "Anchor": "#create-file-[deprecated]",
      "IsDeprecated": true
    },
    {
      "OperationId": "DeleteFile",
      "Name": "Delete file [DEPRECATED]",
      "Description": "This action has been deprecated. Please use Delete file instead.\nThis operation deletes a file.",
      "Anchor": "#delete-file-[deprecated]",
      "IsDeprecated": true
    },
    {
      "OperationId": "ExtractFolderV2",
      "Name": "Extract archive to folder [DEPRECATED]",
      "Description": "This action has been deprecated. Please use Extract archive to folder instead.\nThis operation extracts an archive file into a folder (example: .zip).",
      "Anchor": "#extract-archive-to-folder-[deprecated]",
      "IsDeprecated": true
    },
    {
      "OperationId": "GetFileContent",
      "Name": "Get file content [DEPRECATED]",
      "Description": "This action has been deprecated. Please use Get file content instead.\nThis operation gets file contents using the file id.",
      "Anchor": "#get-file-content-[deprecated]",
      "IsDeprecated": true
    },
    {
      "OperationId": "GetFileContentByPath",
      "Name": "Get file content using path [DEPRECATED]",
      "Description": "This action has been deprecated. Please use Get file content using path instead.\nThis operation gets file contents using the file path.",
      "Anchor": "#get-file-content-using-path-[deprecated]",
      "IsDeprecated": true
    },
    {
      "OperationId": "GetFileMetadata",
      "Name": "Get file metadata [DEPRECATED]",
      "Description": "This action has been deprecated. Please use Get file metadata instead.\nThis operation gets file metadata using the file id.",
      "Anchor": "#get-file-metadata-[deprecated]",
      "IsDeprecated": true
    },
    {
      "OperationId": "GetFileMetadataByPath",
      "Name": "Get file metadata using path [DEPRECATED]",
      "Description": "This action has been deprecated. Please use Get file metadata using path instead.\nThis operation gets file metadata using the file path.",
      "Anchor": "#get-file-metadata-using-path-[deprecated]",
      "IsDeprecated": true
    },
    {
      "OperationId": "ListFolder",
      "Name": "List files in folder [DEPRECATED]",
      "Description": "This action has been deprecated. Please use List files in folder instead.\nThis operation gets files contained in a folder.",
      "Anchor": "#list-files-in-folder-[deprecated]",
      "IsDeprecated": true
    },
    {
      "OperationId": "ListRootFolder",
      "Name": "List files in root folder [DEPRECATED]",
      "Description": "This action has been deprecated. Please use List files in root folder instead.\nThis operation gets the files in the root folder.",
      "Anchor": "#list-files-in-root-folder-[deprecated]",
      "IsDeprecated": true
    },
    {
      "OperationId": "OnUpdatedFile",
      "Name": "When a file is added or modified [DEPRECATED]",
      "Description": "This action has been deprecated. Please use When a file is added or modified instead.\nThis operation triggers a flow when a file is added or modified in a folder. The trigger will fetch both the file metadata as well as the content of the file. The trigger relies on the last modified time of a file. If a file is being created by a third-party client, the preservation of the last modified time should be disabled in the client. Files larger than 50 megabytes are skipped by the trigger. The trigger does not fire if a file is added/updated in a subfolder. If it is required to trigger on subfolders, multiple triggers should be created.",
      "Anchor": "#when-a-file-is-added-or-modified-[deprecated]",
      "IsDeprecated": true
    },
    {
      "OperationId": "OnUpdatedFiles",
      "Name": "When a file is added or modified (properties only) [DEPRECATED]",
      "Description": "This action has been deprecated. Please use When files are added or modified (properties only) instead.\nThis operation triggers a flow when a file is added or modified in a folder. This trigger will only fetch the file metadata. To get the file content, you can use the &quot;Get file content&quot; operation. The trigger relies on the last modified time of a file. If a file is being created by a third-party client, the preservation of the last modified time should be disabled in the client. The trigger does not fire if a file is added/updated in a subfolder. If it is required to trigger on subfolders, multiple triggers should be created.",
      "Anchor": "#when-a-file-is-added-or-modified-(properties-only)-[deprecated]",
      "IsDeprecated": true
    },
    {
      "OperationId": "UpdateFile",
      "Name": "Update file [DEPRECATED]",
      "Description": "This action has been deprecated. Please use Update file instead.\nThis operation updates the file content. If a file is being deleted/renamed on server right after it was updated, connector may return HTTP 404 error by it's design. Please use a delay for 1 minute before deleting or renaming recently updated file.",
      "Anchor": "#update-file-[deprecated]",
      "IsDeprecated": true
    }
  ]
}